In [2]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

In [7]:
customers = pd.DataFrame({
    'CustomerID': [1, 2, 3, 4, 5],
    'Name': ['Aditya', 'Nishcal', "Sudip", None, None], 
    'Age': [22, np.nan, 14, np.nan, 28]
})

orders = pd.DataFrame({
    'OrderID': [1, 2, 3, 4],
    'CustomerID': [1, 2, 3,None],
    'Amount': ["300",None,"200","400"]
})

print("\nOriginal Customers Data: ")

print(orders)
print(customers)

Original Customers Data:
   OrderID  CustomerID Amount
0        1         1.0    300
1        2         2.0   None
2        3         3.0    200
3        4         NaN    400
   CustomerID     Name   Age
0           1   Aditya  22.0
1           2  Nishcal   NaN
2           3    Sudip  14.0
3           4     None   NaN
4           5     None  28.0

In [8]:
# remove null values
new_customer = customers.dropna(subset=["Name"])
new_customer

   CustomerID     Name   Age
0           1   Aditya  22.0
1           2  Nishcal   NaN
2           3    Sudip  14.0

In [9]:
new_customer["Age"] = new_customer["Age"].fillna(new_customer['Age'].mean())
new_customer

C:\Users\ASUS\AppData\Local\Temp\ipykernel_18352\1707201219.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  new_customer["Age"] = new_customer["Age"].fillna(new_customer['Age'].mean())

   CustomerID     Name   Age
0           1   Aditya  22.0
1           2  Nishcal  18.0
2           3    Sudip  14.0

In [10]:
orders["Amount"] = pd.to_numeric(orders['Amount'],errors="coerce").fillna(0)
orders

   OrderID  CustomerID  Amount
0        1         1.0   300.0
1        2         2.0     0.0
2        3         3.0   200.0
3        4         NaN   400.0

In [12]:
merge = pd.merge(new_customer,orders, on = "CustomerID",how="left")
merge

   CustomerID     Name   Age  OrderID  Amount
0           1   Aditya  22.0        1   300.0
1           2  Nishcal  18.0        2     0.0
2           3    Sudip  14.0        3   200.0

In [13]:
merge["Amount_in_thousands"]= merge["Amount"]/1000
merge

   CustomerID     Name   Age  OrderID  Amount  Amount_in_thousands
0           1   Aditya  22.0        1   300.0                  0.3
1           2  Nishcal  18.0        2     0.0                  0.0
2           3    Sudip  14.0        3   200.0                  0.2

In [15]:
#normalize age
merge["normalized_age"] = ((merge["Age"]-merge["Age"].min()))/(merge["Age"].max()-merge["Age"].min())
merge

,CustomerID,Name,Age,OrderID,Amount,Amount_in_thousands,normalized_age
0,1,Aditya,22.0,1,300.0,0.3,1.0
1,2,Nishcal,18.0,2,0.0,0.0,0.5
2,3,Sudip,14.0,3,200.0,0.2,0.0

In [16]:
merge["age_group"] = pd.cut(merge["Age"], bins=[0,15, 30], labels=["Young", "Adult"])
merge

,CustomerID,Name,Age,OrderID,Amount,Amount_in_thousands,normalized_age,age_group
0,1,Aditya,22.0,1,300.0,0.3,1.0,Adult
1,2,Nishcal,18.0,2,0.0,0.0,0.5,Adult
2,3,Sudip,14.0,3,200.0,0.2,0.0,Young